In [23]:
import numpy as np
import pandas as pd

In [24]:
my_array = ['David ',' yael',' Avi ']
my_pandas_series = pd.Series(my_array)
print(my_pandas_series)

0    David
1      yael
2      Avi
dtype: object

In [25]:
my_data = my_pandas_series.str.strip()
my_data = my_pandas_series.str.replace(' ','').str.capitalize().str.strip()
print(my_data)

0    David
1     Yael
2      Avi
dtype: object

In [26]:
def clean(name):
    name = name.replace(' ','')
    name = name.strip()
    name = name.capitalize()
    return name
my_data = my_pandas_series.apply(clean)
print(my_data)

0    David
1     Yael
2      Avi
dtype: object

In [27]:
dates = ['Jan 5, 2024','Nov 3, 2023','01-30-2024']
dates_series = pd.Series(dates)
dates_series = pd.to_datetime(dates_series,format='mixed')
dates_series.dt.strftime('y%-%m-%d')
print(dates_series)

0   2024-01-05
1   2023-11-03
2   2024-01-30
dtype: datetime64[ns]

In [28]:
drinks_data = pd.read_csv('csv/RetailSales_BeerWineLiquor.csv')
print(drinks_data)

           DATE  Total_Sales
0    1992-01-01         1509
1    1992-02-01         1541
2    1992-03-01         1597
3    1992-04-01         1675
4    1992-05-01         1822
..          ...          ...
335  2019-12-01         6630
336  2020-01-01         4388
337  2020-02-01         4533
338  2020-03-01         5562
339  2020-04-01         5207

[340 rows x 2 columns]

In [29]:
drinks_data['DATE'] = pd.to_datetime(drinks_data['DATE'])
drinks_data = drinks_data.set_index('DATE')
drinks_data.resample(rule='YE').sum()

            Total_Sales
DATE
1992-12-31        21687
1993-12-31        21538
1994-12-31        22101
1995-12-31        22007
1996-12-31        23157
1997-12-31        24081
1998-12-31        25382
1999-12-31        26476
2000-12-31        28507
2001-12-31        29621
2002-12-31        29894
2003-12-31        30469
2004-12-31        32189
2005-12-31        33567
2006-12-31        36016
2007-12-31        38128
2008-12-31        39504
2009-12-31        40245
2010-12-31        41401
2011-12-31        42392
2012-12-31        44365
2013-12-31        46076
2014-12-31        48286
2015-12-31        50550
2016-12-31        53213
2017-12-31        55232
2018-12-31        57968
2019-12-31        59673
2020-12-31        19690

In [30]:
data = {
    'Date': ['2021-01-01', '2021-01-01', '2021-01-02', '2021-01-02', '2021-01-03', '2021-01-03'],
    'Product': ['Apples', 'Oranges', 'Apples', 'Oranges', 'Apples', 'Oranges'],
    'Sales': [100, 120, 200, 220, 300, 320]
}
df = pd.DataFrame(data,index=['A','B','C','D','E','F'])
df

         Date  Product  Sales
A  2021-01-01   Apples    100
B  2021-01-01  Oranges    120
C  2021-01-02   Apples    200
D  2021-01-02  Oranges    220
E  2021-01-03   Apples    300
F  2021-01-03  Oranges    320

In [31]:
pivot = pd.pivot_table(df,columns = 'Product', values='Sales',index='Date',aggfunc='sum')
pivot

Product     Apples  Oranges
Date
2021-01-01     100      120
2021-01-02     200      220
2021-01-03     300      320

In [33]:
df.to_csv('csv/data.csv',index=True)
df.to_excel('csv/data.xlsx')
df.to_html('csv/data.html')